IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_hic_cfg_regs.xml
<module id="HIC_CFG_REGS" HW_revision="" description="HIC CFG Registers">
	<register id="HICREV" width="32" page="1" offset="0x0" internal="0" description="Module Revision Register">
		<bitfield id="MINOR" description="Minor Revision Number" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="Custom Module Number" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="Major Revision Number" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="RTL" description="Design Release Number" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="FUNC" description="Functional Release Number" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="Defines Scheme for Module" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="HICGCR" width="32" page="1" offset="0x2" internal="0" description="Global Control Register">
		<bitfield id="HICEN" description="Host Interface Enable" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="HICLOCK" width="32" page="1" offset="0x4" internal="0" description="Lock Register">
		<bitfield id="LOCK" description="LOCK enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_ENABLE_KEY" description="Key for enabling write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="HICMODECR" width="32" page="1" offset="0x6" internal="0" description="Mode Control Register">
		<bitfield id="DW_MODE" description="Data Width Mode" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="RW_MODE" description="Read-Write Mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="BEN_PRESENT" description="Byte Enable Pins are present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RDY_PRESENT" description="Ready pin present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="H2DBUF_DEVWREN" description="Write Enable for Device to H2D Buffer" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="D2HBUF_HOSTWREN" description="Write Enable for Host to D2H Buffer" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EN_DEVACC" description="Enable Host access to Device region" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EN_HOSTWREALLOW" description="Enable Host Write to EALLOWCTL register" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="HICPINPOLCR" width="32" page="1" offset="0x8" internal="0" description="Pin Polarity Control Register">
		<bitfield id="CS_POL" description="Chip Select Polarity" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BEN_POL" description="Byte Enable Polarity" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OE_POL" description="Output Enable Polarity" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="WE_POL" description="Write Enable Polarity" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RDY_POL" description="Ready Polarity" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="HICBASESEL" width="32" page="1" offset="0xa" internal="0" description="Base Select Register">
		<bitfield id="BASE_SELECT" description="Base Select" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="HICHOSTCR" width="32" page="1" offset="0xc" internal="0" description="HIC Host Control Register">
		<bitfield id="EALLOW_EN" description="EALLOW Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACCSIZE" description="Access Size" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PAGESEL" description="Page Select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HKEY" description="Host Key" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="HICERRADDR" width="32" page="1" offset="0xe" internal="0" description="Host Error Address register">
		<bitfield id="H2D_ERR_ADDR" description="Address of the Host bus captured upon an error for Device" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="H2D_BASE_SEL" description="Base Select corresponding to H2D error event" begin="14" end="12" width="3" rwaccess="R"/>
		<bitfield id="D2H_ERR_ADDR" description="Address of the Host bus captured upon an error for Host" begin="23" end="16" width="8" rwaccess="R"/>
		<bitfield id="D2H_BASE_SEL" description="Base Select corresponding to D2H error event" begin="30" end="28" width="3" rwaccess="R"/>
	</register>
	<register id="HICH2DTOKEN" width="32" page="1" offset="0x10" internal="0" description="Host to Device Token Register">
		<bitfield id="H2D_TOKEN" description="Host to Device Token" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HICD2HTOKEN" width="32" page="1" offset="0x12" internal="0" description="Devie to Host Token Register">
		<bitfield id="D2H_TOKEN" description="Device To Host Token" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR0" width="32" page="1" offset="0x14" internal="0" description="Device Base Address Register 0">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR1" width="32" page="1" offset="0x16" internal="0" description="Device Base Address Register 1">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR2" width="32" page="1" offset="0x18" internal="0" description="Device Base Address Register 2">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR3" width="32" page="1" offset="0x1a" internal="0" description="Device Base Address Register 3">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR4" width="32" page="1" offset="0x1c" internal="0" description="Device Base Address Register 4">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR5" width="32" page="1" offset="0x1e" internal="0" description="Device Base Address Register 5">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR6" width="32" page="1" offset="0x20" internal="0" description="Device Base Address Register 6">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICDBADDR7" width="32" page="1" offset="0x22" internal="0" description="Device Base Address Register 7">
		<bitfield id="BASE_ADDR" description="Base address of device region" begin="31" end="7" width="25" rwaccess="RW"/>
	</register>
	<register id="HICH2DINTEN" width="32" page="1" offset="0x28" internal="0" description="H2D Interrupt Enable">
		<bitfield id="H2D_INTEN" description="Host To Device Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUSERR_INTEN" description="BusError Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ILLWR_INTEN" description="Illegal Write event interrupt enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ILLRD_INTEN" description="Illegal Read event interrupt enable" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="HICH2DINTFLG" width="32" page="1" offset="0x2a" internal="0" description="H2D Interrupt status Flag">
		<bitfield id="H2D_FLG" description="Host To Device Interrupt Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="BUSERR_FLG" description="BusError Interrupt Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ILLWR_FLG" description="Illegal write event interrupt flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ILLRD_FLG" description="Illegal read event interrupt flag" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="HICH2DINTCLR" width="32" page="1" offset="0x2c" internal="0" description="H2D Interrupt status Clear">
		<bitfield id="H2D_CLR" description="Host To Device Interrupt Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUSERR_CLR" description="BusError Interrupt  Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ILLWR_CLR" description="Illegal Write Interrupt Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ILLRD_CLR" description="Illegal Read Interrupt Clear" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="HICH2DINTFRC" width="32" page="1" offset="0x2e" internal="0" description="H2D Interrupt Set Force">
		<bitfield id="H2D_INTFRC" description="Host To Device Force Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUSERR_INTFRC" description="BusError Interrupt Force Set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ILLWR_INTFRC" description="Illegal Write Interrupt Force Set" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ILLRD_INTFRC" description="Illegal Read Interrupt Force Set" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="HICD2HINTEN" width="32" page="1" offset="0x30" internal="0" description="D2H Interrupt Enable">
		<bitfield id="D2H_INTEN" description="Device to Host Data Ready Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUSERR_INTEN" description="BusError Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ILLWR_INTEN" description="Illegal Write event Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ILLRD_INTEN" description="Illegal Read event Interrupt Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ACCVIO_INTEN" description="Access Violation Interrupt Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVTRIG_INTEN" description="Event Trigger Interrupt Enable" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="HICD2HINTFLG" width="32" page="1" offset="0x32" internal="0" description="D2H Interrupt status Flag">
		<bitfield id="D2H_FLG" description="Device to Host Data Ready Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="BUSERR_FLG" description="BusError Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ILLWR_FLG" description="Illegal Write event Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ILLRD_FLG" description="Illegal Read event Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ACCVIO_FLG" description="Access Violation Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EVTRIG_FLG" description="Event Trigger Flag" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="HICD2HINTCLR" width="32" page="1" offset="0x34" internal="0" description="D2H Interrupt status Clear">
		<bitfield id="D2H_CLR" description="Device to Host Interrupt Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUSERR_CLR" description="BusError Interrupt  Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ILLWR_CLR" description="Illegal Write Interrupt Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ILLRD_CLR" description="Illegal Read Interrupt Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ACCVIO_CLR" description="Access Violation Interrupt Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVTRIG_CLR" description="Event Trigger Interrupt Clear" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="HICD2HINTFRC" width="32" page="1" offset="0x36" internal="0" description="D2H Interrupt Set Force">
		<bitfield id="D2H_INTFRC" description="Device to Host Force Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUSERR_INTFRC" description="BusError Interrupt Force Set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ILLWR_INTFRC" description="Illegal Write Interrupt Force Set" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ILLRD_INTFRC" description="Illegal Read Interrupt Force Set" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ACCVIO_INTFRC" description="Access Violation Interrupt Force Set" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EVTRIG_INTFRC" description="Event Trigger Interrupt Force Set" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="HICACCVIOADDR" width="32" page="1" offset="0x38" internal="0" description="Access Violation Address ">
		<bitfield id="ACCVIO_ADDR" description="Address of the Master Port captured upon access violations" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="H2D_BUF0" width="32" page="1" offset="0x40" internal="0" description="Host to Device Buffer 0">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF1" width="32" page="1" offset="0x42" internal="0" description="Host to Device Buffer 1">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF2" width="32" page="1" offset="0x44" internal="0" description="Host to Device Buffer 2">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF3" width="32" page="1" offset="0x46" internal="0" description="Host to Device Buffer 3">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF4" width="32" page="1" offset="0x48" internal="0" description="Host to Device Buffer 4">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF5" width="32" page="1" offset="0x4a" internal="0" description="Host to Device Buffer 5">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF6" width="32" page="1" offset="0x4c" internal="0" description="Host to Device Buffer 6">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF7" width="32" page="1" offset="0x4e" internal="0" description="Host to Device Buffer 7">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF8" width="32" page="1" offset="0x50" internal="0" description="Host to Device Buffer 8">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF9" width="32" page="1" offset="0x52" internal="0" description="Host to Device Buffer 9">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF10" width="32" page="1" offset="0x54" internal="0" description="Host to Device Buffer 10">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF11" width="32" page="1" offset="0x56" internal="0" description="Host to Device Buffer 11">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF12" width="32" page="1" offset="0x58" internal="0" description="Host to Device Buffer 12">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF13" width="32" page="1" offset="0x5a" internal="0" description="Host to Device Buffer 13">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF14" width="32" page="1" offset="0x5c" internal="0" description="Host to Device Buffer 14">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="H2D_BUF15" width="32" page="1" offset="0x5e" internal="0" description="Host to Device Buffer 15">
		<bitfield id="Data" description="Host to Device data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF0" width="32" page="1" offset="0x60" internal="0" description="Device to Host Buffer 0">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF1" width="32" page="1" offset="0x62" internal="0" description="Device to Host Buffer 1">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF2" width="32" page="1" offset="0x64" internal="0" description="Device to Host Buffer 2">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF3" width="32" page="1" offset="0x66" internal="0" description="Device to Host Buffer 3">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF4" width="32" page="1" offset="0x68" internal="0" description="Device to Host Buffer 4">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF5" width="32" page="1" offset="0x6a" internal="0" description="Device to Host Buffer 5">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF6" width="32" page="1" offset="0x6c" internal="0" description="Device to Host Buffer 6">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF7" width="32" page="1" offset="0x6e" internal="0" description="Device to Host Buffer 7">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF8" width="32" page="1" offset="0x70" internal="0" description="Device to Host Buffer 8">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF9" width="32" page="1" offset="0x72" internal="0" description="Device to Host Buffer 9">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF10" width="32" page="1" offset="0x74" internal="0" description="Device to Host Buffer 10">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF11" width="32" page="1" offset="0x76" internal="0" description="Device to Host Buffer 11">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF12" width="32" page="1" offset="0x78" internal="0" description="Device to Host Buffer 12">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF13" width="32" page="1" offset="0x7a" internal="0" description="Device to Host Buffer 13">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF14" width="32" page="1" offset="0x7c" internal="0" description="Device to Host Buffer 14">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="D2H_BUF15" width="32" page="1" offset="0x7e" internal="0" description="Device to Host Buffer 15">
		<bitfield id="Data" description="Device to Host data buffer 0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
